# Project 2: UFO Sightings in Wyoming and Yellowstone National Park Visitation

## Group 4: Armand Dauti, Jacob Douthett, and Sam Espe

### Overview

INSERT OVERVIEW HERE

### Extract

In [1]:
# Import dependencies

import pandas as pd
from sqlalchemy import create_engine, inspect
from datetime import datetime

In [2]:
# Extract data into dataframes

ufo_file = "Resources/ufo_data_scrubbed.csv"
ufo_df = pd.read_csv(ufo_file)

ufo_df.head()

C:\Users\itssm\AppData\Local\Temp\ipykernel_3420\911020618.py:4: DtypeWarning: Columns (5,9) have mixed types. Specify dtype option on import or set low_memory=False.
  ufo_df = pd.read_csv(ufo_file)

,datetime,city,state,country,shape,duration (seconds),duration (hours/min),comments,date posted,latitude,longitude
0,10/10/1949 20:30,san marcos,tx,us,cylinder,2700,45 minutes,This event took place in early fall around 194...,4/27/2004,29.8830556,-97.941111
1,10/10/1949 21:00,lackland afb,tx,NaN,light,7200,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,12/16/2005,29.38421,-98.581082
2,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20,20 seconds,Green/Orange circular disc over Chester&#44 En...,1/21/2008,53.2,-2.916667
3,10/10/1956 21:00,edna,tx,us,circle,20,1/2 hour,My older brother and twin sister were leaving ...,1/17/2004,28.9783333,-96.645833
4,10/10/1960 20:00,kaneohe,hi,us,light,900,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,1/22/2004,21.4180556,-157.803611

In [3]:
yellowstone_file = "Resources/Yellostone_Annual_Park_Recreation_Visitation_1904-2018.csv"
yellowstone_df = pd.read_csv(yellowstone_file)

yellowstone_df.head()

   year recreationvisitors totalrecreationvisitors
0  1904             13,727             183,271,650
1  1905             26,188             183,271,650
2  1906             17,182             183,271,650
3  1907             16,414             183,271,650
4  1908             19,542             183,271,650

### Transform

#### Transform UFO data

In [4]:
# Drop entries that have NaN values

ufo_no_nan_states = ufo_df.dropna(axis=0, how='any')

ufo_no_nan_states.head()

,datetime,city,state,country,shape,duration (seconds),duration (hours/min),comments,date posted,latitude,longitude
0,10/10/1949 20:30,san marcos,tx,us,cylinder,2700,45 minutes,This event took place in early fall around 194...,4/27/2004,29.8830556,-97.941111
3,10/10/1956 21:00,edna,tx,us,circle,20,1/2 hour,My older brother and twin sister were leaving ...,1/17/2004,28.9783333,-96.645833
4,10/10/1960 20:00,kaneohe,hi,us,light,900,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,1/22/2004,21.4180556,-157.803611
5,10/10/1961 19:00,bristol,tn,us,sphere,300,5 minutes,My father is now 89 my brother 52 the girl wit...,4/27/2007,36.5950000,-82.188889
7,10/10/1965 23:45,norwalk,ct,us,disk,1200,20 minutes,A bright orange color changing to reddish colo...,10/2/1999,41.1175000,-73.408333

In [5]:
# Filter UFO dataframe to include only entries from Wyoming

ufos_wyoming_df = ufo_no_nan_states[ufo_no_nan_states["state"].str.contains("wy")]

ufos_wyoming_df.head()

,datetime,city,state,country,shape,duration (seconds),duration (hours/min),comments,date posted,latitude,longitude
881,10/1/2008 20:00,glenrock,wy,us,unknown,1200,several hours,Stationary object just above NE horizon with f...,10/31/2008,42.8613889,-105.871667
1340,10/13/2006 20:30,rawlins,wy,us,triangle,30,30 sec,I was sitting in my hot tub looking at the sky...,10/30/2006,41.7911111,-107.238056
2021,10/15/2001 03:00,chugwater,wy,us,light,30,30 seconds,F.E. Warren AFB Wyoming sightings,9/9/2003,41.7566667,-104.821111
2057,10/15/2002 18:00,bosler,wy,us,unknown,120,2 minutes,Women pass through Bosler&#44 Wyoming twice wi...,10/31/2003,41.5761111,-105.694722
2207,10/15/2010 02:30,cheyenne,wy,us,light,900,15 minutes,U.F.O in Cheyenne&#44 Wyoming,11/21/2010,41.1400000,-104.819722

In [6]:
# Dropping indices #6496 and #37861 because the datetime objects are invalid

ufos_wyoming_df = ufos_wyoming_df.drop(index=6496)
ufos_wyoming_df = ufos_wyoming_df.drop(index=37861)

In [7]:
# Extract year from datetime object, save it to its own series

ufos_wyoming_df['year'] = pd.DatetimeIndex(ufos_wyoming_df['datetime']).year

ufos_wyoming_df.head()

,datetime,city,state,country,shape,duration (seconds),duration (hours/min),comments,date posted,latitude,longitude,year
881,10/1/2008 20:00,glenrock,wy,us,unknown,1200,several hours,Stationary object just above NE horizon with f...,10/31/2008,42.8613889,-105.871667,2008
1340,10/13/2006 20:30,rawlins,wy,us,triangle,30,30 sec,I was sitting in my hot tub looking at the sky...,10/30/2006,41.7911111,-107.238056,2006
2021,10/15/2001 03:00,chugwater,wy,us,light,30,30 seconds,F.E. Warren AFB Wyoming sightings,9/9/2003,41.7566667,-104.821111,2001
2057,10/15/2002 18:00,bosler,wy,us,unknown,120,2 minutes,Women pass through Bosler&#44 Wyoming twice wi...,10/31/2003,41.5761111,-105.694722,2002
2207,10/15/2010 02:30,cheyenne,wy,us,light,900,15 minutes,U.F.O in Cheyenne&#44 Wyoming,11/21/2010,41.1400000,-104.819722,2010

In [13]:
# Filter columns of UFO dataframe to include only: Year, City, State, Duration (seconds), Shape, and Comments

ufos_wy_for_db = ufos_wyoming_df.copy()

ufos_wy_for_db = ufos_wy_for_db.drop(labels=["datetime", "country", "duration (hours/min)", "date posted", "latitude", "longitude "], axis = 1)

In [14]:
# Rename columns

ufos_wy_for_db = ufos_wy_for_db.rename(columns={"duration (seconds)":"duration_seconds", "shape":"ufo_shape", "comments":"sighting_description"})

ufos_wy_for_db

,city,state,ufo_shape,duration_seconds,sighting_description,year
881,glenrock,wy,unknown,1200,Stationary object just above NE horizon with f...,2008
1340,rawlins,wy,triangle,30,I was sitting in my hot tub looking at the sky...,2006
2021,chugwater,wy,light,30,F.E. Warren AFB Wyoming sightings,2001
2057,bosler,wy,unknown,120,Women pass through Bosler&#44 Wyoming twice wi...,2002
2207,cheyenne,wy,light,900,U.F.O in Cheyenne&#44 Wyoming,2010
...,...,...,...,...,...,...
78749,laramie,wy,other,1500.0,large craft white streak in sky at18:30 about...,2007
79058,cheyenne,wy,cigar,60.0,Saw two silver objects flying over Cheyenne. P...,1998
79534,gillette,wy,fireball,5.0,Neon green flying object seen over Gillette&#4...,2002
79536,baggs,wy,oval,60.0,blue florecent oval with a red long tail&#44sa...,2002
79537,sheridan,wy,oval,20.0,blue-green bright oval was spotted 20 miles so...,2002

In [15]:
# Fix duration data type — make the whole series floating points instead of strings.

ufos_wy_for_db.duration_seconds = ufos_wy_for_db.duration_seconds.astype(float)

ufos_wy_for_db

,city,state,ufo_shape,duration_seconds,sighting_description,year
881,glenrock,wy,unknown,1200.0,Stationary object just above NE horizon with f...,2008
1340,rawlins,wy,triangle,30.0,I was sitting in my hot tub looking at the sky...,2006
2021,chugwater,wy,light,30.0,F.E. Warren AFB Wyoming sightings,2001
2057,bosler,wy,unknown,120.0,Women pass through Bosler&#44 Wyoming twice wi...,2002
2207,cheyenne,wy,light,900.0,U.F.O in Cheyenne&#44 Wyoming,2010
...,...,...,...,...,...,...
78749,laramie,wy,other,1500.0,large craft white streak in sky at18:30 about...,2007
79058,cheyenne,wy,cigar,60.0,Saw two silver objects flying over Cheyenne. P...,1998
79534,gillette,wy,fireball,5.0,Neon green flying object seen over Gillette&#4...,2002
79536,baggs,wy,oval,60.0,blue florecent oval with a red long tail&#44sa...,2002
79537,sheridan,wy,oval,20.0,blue-green bright oval was spotted 20 miles so...,2002

#### Transform Yellowstone Data

In [ ]:
# Filter columns of Yellowstone dataframe to include only Year and Recreation Visitors

yellowstone_df = yellowstone_df.drop(labels = "totalrecreationvisitors", axis = 1)

In [24]:
# Rename recreationvisitors column

yellowstone_df = yellowstone_df.rename(columns={"recreationvisitors":"visitor_count"})
yellowstone_df

     year visitor_count
0    1904        13,727
1    1905        26,188
2    1906        17,182
3    1907        16,414
4    1908        19,542
..    ...           ...
110  2014     3,513,484
111  2015     4,097,710
112  2016     4,257,177
113  2017     4,116,524
114  2018     4,115,000

[115 rows x 2 columns]

In [28]:
# Remove commas from visitor_counts so we can turn into integer

yellowstone_df.visitor_count = yellowstone_df.visitor_count.str.replace(",", "")

yellowstone_df

     year visitor_count
0    1904         13727
1    1905         26188
2    1906         17182
3    1907         16414
4    1908         19542
..    ...           ...
110  2014       3513484
111  2015       4097710
112  2016       4257177
113  2017       4116524
114  2018       4115000

[115 rows x 2 columns]

In [29]:
# Change data type of visitor_count column from string to integer

yellowstone_df.visitor_count = yellowstone_df.visitor_count.astype(int)

print(yellowstone_df.dtypes)

year             int64
visitor_count    int32
dtype: object

### Load

#### Load UFO data into SQL database

#### Load Yellowstone data into SQL database